wattanaipongtham/VRMICROS/hardware/vrmicros/0.0.1/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# VRMICROS Basic Board
VRMICROS.name=VRMICROS Basic Board
VRMICROS.build.core=arduino
VRMICROS.build.board=Basic
VRMICROS.build.mcu=cortex-m3
VRMICROS.build.series=STM32F1xx
VRMICROS.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
VRMICROS.build.flash_offset=0x0
VRMICROS.upload.maximum_size=0
VRMICROS.upload.maximum_data_size=0



# VRMICROS Basic board
VRMICROS.menu.pnum.Basic=VRMICROS Basic
VRMICROS.menu.pnum.Basic.upload.maximum_size=65536
VRMICROS.menu.pnum.Basic.upload.maximum_data_size=20480
VRMICROS.menu.pnum.Basic.build.board=VRMICROS_Basic_Board
VRMICROS.menu.pnum.Basic.build.product_line=STM32F103xB

# Upload menu
VRMICROS.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
VRMICROS.menu.upload_method.swdMethod.upload.protocol=0
VRMICROS.menu.upload_method.swdMethod.upload.options=
VRMICROS.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

VRMICROS.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
VRMICROS.menu.upload_method.serialMethod.upload.protocol=1
VRMICROS.menu.upload_method.serialMethod.upload.options={serial.port.file}
VRMICROS.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

VRMICROS.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
VRMICROS.menu.upload_method.dfuMethod.upload.protocol=2
VRMICROS.menu.upload_method.dfuMethod.upload.options=
VRMICROS.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

VRMICROS.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
VRMICROS.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
VRMICROS.menu.upload_method.bmpMethod.upload.tool=bmp_upload

VRMICROS.menu.upload_method.hidMethod=HID Bootloader 2.2
VRMICROS.menu.upload_method.hidMethod.upload.protocol=hid22
VRMICROS.menu.upload_method.hidMethod.upload.tool=hid_upload
VRMICROS.menu.upload_method.hidMethod.build.flash_offset=0x800
VRMICROS.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

VRMICROS.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
VRMICROS.menu.upload_method.dfu2Method.upload.protocol=maple
VRMICROS.menu.upload_method.dfu2Method.upload.tool=maple_upload
VRMICROS.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
VRMICROS.menu.upload_method.dfu2Method.upload.altID=2
VRMICROS.menu.upload_method.dfu2Method.build.flash_offset=0x2000
VRMICROS.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF

VRMICROS.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
VRMICROS.menu.upload_method.dfuoMethod.upload.protocol=maple
VRMICROS.menu.upload_method.dfuoMethod.upload.tool=maple_upload
VRMICROS.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
VRMICROS.menu.upload_method.dfuoMethod.upload.altID=1
VRMICROS.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
VRMICROS.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF

################################################################################
# Serialx activation
VRMICROS.menu.xserial.generic=Enabled (generic 'Serial')
VRMICROS.menu.xserial.none=Enabled (no generic 'Serial')
VRMICROS.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
VRMICROS.menu.xserial.disabled=Disabled (no Serial support)
VRMICROS.menu.xserial.disabled.build.xSerial=

# USB connectivity
VRMICROS.menu.usb.none=None
VRMICROS.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
VRMICROS.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
VRMICROS.menu.usb.CDC=CDC (no generic 'Serial')
VRMICROS.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
VRMICROS.menu.usb.HID=HID (keyboard and mouse)
VRMICROS.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
VRMICROS.menu.xusb.FS=Low/Full Speed
VRMICROS.menu.xusb.HS=High Speed
VRMICROS.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
VRMICROS.menu.xusb.HSFS=High Speed in Full Speed mode
VRMICROS.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
VRMICROS.menu.opt.osstd=Smallest (-Os default)
VRMICROS.menu.opt.oslto=Smallest (-Os) with LTO
VRMICROS.menu.opt.oslto.build.flags.optimize=-Os -flto
VRMICROS.menu.opt.o1std=Fast (-O1)
VRMICROS.menu.opt.o1std.build.flags.optimize=-O1
VRMICROS.menu.opt.o1lto=Fast (-O1) with LTO
VRMICROS.menu.opt.o1lto.build.flags.optimize=-O1 -flto
VRMICROS.menu.opt.o2std=Faster (-O2)
VRMICROS.menu.opt.o2std.build.flags.optimize=-O2
VRMICROS.menu.opt.o2lto=Faster (-O2) with LTO
VRMICROS.menu.opt.o2lto.build.flags.optimize=-O2 -flto
VRMICROS.menu.opt.o3std=Fastest (-O3)
VRMICROS.menu.opt.o3std.build.flags.optimize=-O3
VRMICROS.menu.opt.o3lto=Fastest (-O3) with LTO
VRMICROS.menu.opt.o3lto.build.flags.optimize=-O3 -flto
VRMICROS.menu.opt.ogstd=Debug (-Og)
VRMICROS.menu.opt.ogstd.build.flags.optimize=-Og
VRMICROS.menu.opt.o0std=No Optimization (-O0)
VRMICROS.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
VRMICROS.menu.dbg.none=None
VRMICROS.menu.dbg.enable_sym=Symbols Enabled (-g)
VRMICROS.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
VRMICROS.menu.dbg.enable_log=Core logs Enabled
VRMICROS.menu.dbg.enable_log.build.flags.debug=
VRMICROS.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
VRMICROS.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
VRMICROS.menu.rtlib.nano=Newlib Nano (default)
VRMICROS.menu.rtlib.nanofp=Newlib Nano + Float Printf
VRMICROS.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
VRMICROS.menu.rtlib.nanofs=Newlib Nano + Float Scanf
VRMICROS.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
VRMICROS.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
VRMICROS.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
VRMICROS.menu.rtlib.full=Newlib Standard
VRMICROS.menu.rtlib.full.build.flags.ldspecs=
